#include "Command.h"




/***************************************道闸标志物功能************************************************/

/**************************************************************************
函数功能：命令-开启闸门
入口参数：无
返回  值：无
**************************************************************************/
void Command_OpenGate(void)
{
	CAN_TxtoZigbee(Gate_Open, 8);
}



/**************************************************************************
函数功能：命令-关闭闸门
入口参数：无
返回  值：无
**************************************************************************/
void Command_CloseGate(void)
{
	CAN_TxtoZigbee(Gate_Close, 8);
}


/**************************************************************************
函数功能：命令-获取闸门状态
入口参数：无
返回  值：无
**************************************************************************/
void Command_GetGateStates(void)
{
	CAN_TxtoZigbee(Gate_GetStatus, 8);
}


/**************************************************************************
函数功能：命令-设置道闸显示车牌前三位
入口参数：First Second Third  - ASCII码
返回  值：无
**************************************************************************/
void Command_SetGateTop(uint8_t First, uint8_t Second, uint8_t Third)
{
	uint8_t TxBuf[8]={0x55,0x03,0x10,0x00,0x00,0x00,0x00,0xBB};

	TxBuf[3] = First;
	TxBuf[4] = Second;
	TxBuf[5] = Third;

	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;
	CAN_TxtoZigbee(TxBuf, 8);
}



/**************************************************************************
函数功能：命令-设置道闸显示车牌后三位
入口参数：无
返回  值：无
**************************************************************************/
void Command_SetGateLast(uint8_t First, uint8_t Second, uint8_t Third)
{
	uint8_t TxBuf[8]={0x55,0x03,0x11,0x00,0x00,0x00,0x00,0xBB};

	TxBuf[3] = First;
	TxBuf[4] = Second;
	TxBuf[5] = Third;

	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;
	CAN_TxtoZigbee(TxBuf, 8);
}






/*********************************************LED计时标志物功能******************************************************/

/**************************************************************************
函数功能：命令-LED标志物开始计时
入口参数：无
返回  值：无
**************************************************************************/
void Command_StartTim(void)
{
	CAN_TxtoZigbee(SMG_TimOpen, 8);
}



/**************************************************************************
函数功能：命令-LED标志物结束计时
入口参数：无
返回  值：无
**************************************************************************/
void Command_EndTim(void)
{
	CAN_TxtoZigbee(SMG_TimClose, 8);
}

/**************************************************************************
函数功能：命令-LED标志物计时清零
入口参数：无
返回  值：无
**************************************************************************/
void Command_ClearTim(void)
{
	CAN_TxtoZigbee(SMG_TimClear, 8);
}


/**************************************************************************
函数功能：命令-LED标志物显示超声波测距
入口参数：无
返回  值：无
**************************************************************************/
void Command_LEDShowDis(void)
{
	uint8_t TxBuf[8]={0x55,0x04,0x04,0x00,0x00,0x00,0x00,0xBB};
	uint16_t Dis_mm;
	uint8_t bai,shi,ge;

	Dis_mm = (uint16_t)(Distance*10.0);
	if(Dis_mm>999){Dis_mm = 999;}

    // 3. 提取百、十、个位
    bai = Dis_mm / 100;
    shi = (Dis_mm % 100) / 10;
    ge  = Dis_mm % 10;

	TxBuf[4] = bai;
	TxBuf[5] = (shi << 4) | ge ;

	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoZigbee(TxBuf, 8);

}


/**************************************************************************
函数功能：命令-LED标志物显示上面一排
入口参数：First Second Third  - 十进制
返回  值：无
**************************************************************************/
void Command_LEDShowUp(uint8_t First, uint8_t Second, uint8_t Third)
{
	uint8_t TxBuf[8]={0x55,0x04,0x01,0x00,0x00,0x00,0x00,0xBB};

	TxBuf[3] = First;
	TxBuf[4] = Second;
	TxBuf[5] = Third;


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoZigbee(TxBuf, 8);

}

/**************************************************************************
函数功能：命令-LED标志物显示下面一排数据
入口参数：First Second Third  - 十进制
返回  值：无
**************************************************************************/
void Command_LEDShowDown(uint8_t First, uint8_t Second, uint8_t Third)
{
	uint8_t TxBuf[8]={0x55,0x04,0x02,0x00,0x00,0x00,0x00,0xBB};

	TxBuf[3] = First;
	TxBuf[4] = Second;
	TxBuf[5] = Third;


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoZigbee(TxBuf, 8);

}











/*********************************************智能交通信号灯指令******************************************************/


/**************************************************************************
函数功能：命令-信号灯A进入识别模式
入口参数：无
返回  值：无
**************************************************************************/
void Command_TrafficAInMode(void)
{
	CAN_TxtoZigbee(TrafficA_Open, 8);
}




/**************************************************************************
函数功能：命令-信号灯B进入识别模式
入口参数：无
返回  值：无
**************************************************************************/
void Command_TrafficBInMode(void)
{
	CAN_TxtoZigbee(TrafficB_Open, 8);
}



/**************************************************************************
函数功能：命令-信号灯C进入识别模式
入口参数：无
返回  值：无
**************************************************************************/
void Command_TrafficCInMode(void)
{
	CAN_TxtoZigbee(TrafficC_Open, 8);
}



/**************************************************************************
函数功能：命令-信号灯D进入识别模式
入口参数：无
返回  值：无
**************************************************************************/
void Command_TrafficDInMode(void)
{
	CAN_TxtoZigbee(TrafficD_Open, 8);
}



/**************************************************************************
函数功能：命令-发送给信号灯A识别结果
入口参数：0-red 1-green 2-yellow
返回  值：无
**************************************************************************/
void Command_TrafficASend(uint8_t Result)
{
	switch(Result)
	{
	case 0:
		CAN_TxtoZigbee(TrafficA_Red, 8);
		break;
	case 1:
		CAN_TxtoZigbee(TrafficA_Green, 8);
		break;
	case 2:
		CAN_TxtoZigbee(TrafficA_Yellow, 8);
		break;
	}

}

/**************************************************************************
函数功能：命令-发送给信号灯B识别结果
入口参数：0-red 1-green 2-yellow
返回  值：无
**************************************************************************/
void Command_TrafficBSend(uint8_t Result)
{
	switch(Result)
	{
	case 0:
		CAN_TxtoZigbee(TrafficB_Red, 8);
		break;
	case 1:
		CAN_TxtoZigbee(TrafficB_Green, 8);
		break;
	case 2:
		CAN_TxtoZigbee(TrafficB_Yellow, 8);
		break;
	}

}


/**************************************************************************
函数功能：命令-发送给信号灯C识别结果
入口参数：0-red 1-green 2-yellow
返回  值：无
**************************************************************************/
void Command_TrafficCSend(uint8_t Result)
{
	switch(Result)
	{
	case 0:
		CAN_TxtoZigbee(TrafficC_Red, 8);
		break;
	case 1:
		CAN_TxtoZigbee(TrafficC_Green, 8);
		break;
	case 2:
		CAN_TxtoZigbee(TrafficC_Yellow, 8);
		break;
	}

}


/**************************************************************************
函数功能：命令-发送给信号灯D识别结果
入口参数：0-red 1-green 2-yellow
返回  值：无
**************************************************************************/
void Command_TrafficDSend(uint8_t Result)
{
	switch(Result)
	{
	case 0:
		CAN_TxtoZigbee(TrafficD_Red, 8);
		break;
	case 1:
		CAN_TxtoZigbee(TrafficD_Green, 8);
		break;
	case 2:
		CAN_TxtoZigbee(TrafficD_Yellow, 8);
		break;
	}

}




/*********************************************从车指令**************************************************/


/**************************************************************************
函数功能：命令-从车启动
入口参数：无
返回  值：无
**************************************************************************/
void Command_SlaveCarStart(void)
{
	uint8_t TxBuf[8]={0x9f,0x02,0x9f,0x01,0x00,0x00,0x00,0xBB};
	CAN_TxtoZigbee(TxBuf, 8);
}





/*********************************************多功能显示标志物**************************************************/



/**************************************************************************
函数功能：命令-多功能显示标志物A 向上翻页
入口参数：无
返回  值：无
**************************************************************************/
void Command_TFTAPageUp(void)
{
	CAN_TxtoZigbee(TFTA_PageUp, 8);
}



/**************************************************************************
函数功能：命令-多功能显示标志物A 向下翻页
入口参数：无
返回  值：无
**************************************************************************/
void Command_TFTAPageDown(void)
{
	CAN_TxtoZigbee(TFTA_PageDown, 8);
}



/**************************************************************************
函数功能：命令-多功能显示标志物B 向上翻页
入口参数：无
返回  值：无
**************************************************************************/
void Command_TFTBPageUp(void)
{
	CAN_TxtoZigbee(TFTB_PageUp, 8);
}



/**************************************************************************
函数功能：命令-多功能显示标志物B 向下翻页
入口参数：无
返回  值：无
**************************************************************************/
void Command_TFTBPageDown(void)
{
	CAN_TxtoZigbee(TFTB_PageDown, 8);
}



/*********************************************多功能显示标志物**************************************************/

/**************************************************************************
函数功能：命令-发送指令到安卓终端
入口参数：无
返回  值：无
**************************************************************************/
void Command_SendAndroid(uint8_t First, uint8_t Second)
{
	uint8_t TxBuf[8]={0x55,0x03,0x00,0x00,0x00,0x00,0x00,0xBB};

	TxBuf[2] = First;
	TxBuf[3] = Second;


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoWifi(TxBuf, 8);

}


/**************************************************************************
函数功能：命令-安卓终端 开启交通灯识别
入口参数：无
返回  值：无
**************************************************************************/
void Command_AndroidTraffic(void)
{
	Command_SendAndroid(0x01, 0x01);
}

















