#include "Command.h"




/***************************************道闸标志物功能************************************************/

/**************************************************************************
函数功能：命令-开启闸门
入口参数：无
返回  值：无
**************************************************************************/
void Command_OpenGate(void)
{
	CAN_TxtoZigbee(Gate_Open, 8);
}



/**************************************************************************
函数功能：命令-关闭闸门
入口参数：无
返回  值：无
**************************************************************************/
void Command_CloseGate(void)
{
	CAN_TxtoZigbee(Gate_Close, 8);
}


/**************************************************************************
函数功能：命令-获取闸门状态
入口参数：无
返回  值：无
**************************************************************************/
void Command_GetGateStates(void)
{
	CAN_TxtoZigbee(Gate_GetStatus, 8);
}


/**************************************************************************
函数功能：命令-设置道闸显示车牌前三位
入口参数：First Second Third  - ASCII码
返回  值：无
**************************************************************************/
void Command_SetGateTop(uint8_t First, uint8_t Second, uint8_t Third)
{
	uint8_t TxBuf[8]={0x55,0x03,0x10,0x00,0x00,0x00,0x00,0xBB};

	TxBuf[3] = First;
	TxBuf[4] = Second;
	TxBuf[5] = Third;

	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;
	CAN_TxtoZigbee(TxBuf, 8);
}



/**************************************************************************
函数功能：命令-设置道闸显示车牌后三位
入口参数：无
返回  值：无
**************************************************************************/
void Command_SetGateLast(uint8_t First, uint8_t Second, uint8_t Third)
{
	uint8_t TxBuf[8]={0x55,0x03,0x11,0x00,0x00,0x00,0x00,0xBB};

	TxBuf[3] = First;
	TxBuf[4] = Second;
	TxBuf[5] = Third;

	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;
	CAN_TxtoZigbee(TxBuf, 8);
}






/*********************************************LED计时标志物功能******************************************************/

/**************************************************************************
函数功能：命令-LED标志物开始计时
入口参数：无
返回  值：无
**************************************************************************/
void Command_StartTim(void)
{
	CAN_TxtoZigbee(SMG_TimOpen, 8);
}



/**************************************************************************
函数功能：命令-LED标志物结束计时
入口参数：无
返回  值：无
**************************************************************************/
void Command_EndTim(void)
{
	CAN_TxtoZigbee(SMG_TimClose, 8);
}

/**************************************************************************
函数功能：命令-LED标志物计时清零
入口参数：无
返回  值：无
**************************************************************************/
void Command_ClearTim(void)
{
	CAN_TxtoZigbee(SMG_TimClear, 8);
}


/**************************************************************************
函数功能：命令-LED标志物显示超声波测距
入口参数：无
返回  值：无
**************************************************************************/
void Command_LEDShowDis(void)
{
	uint8_t TxBuf[8]={0x55,0x04,0x04,0x00,0x00,0x00,0x00,0xBB};
	uint16_t Dis_mm;
	uint8_t bai,shi,ge;

	Dis_mm = (uint16_t)(Distance*10.0);
	if(Dis_mm>999){Dis_mm = 999;}

    // 3. 提取百、十、个位
    bai = Dis_mm / 100;
    shi = (Dis_mm % 100) / 10;
    ge  = Dis_mm % 10;

	TxBuf[4] = bai;
	TxBuf[5] = (shi << 4) | ge ;

	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoZigbee(TxBuf, 8);

}


/**************************************************************************
函数功能：命令-LED标志物显示上面一排
入口参数：First Second Third  - 十进制
返回  值：无
**************************************************************************/
void Command_LEDShowUp(uint8_t First, uint8_t Second, uint8_t Third)
{
	uint8_t TxBuf[8]={0x55,0x04,0x01,0x00,0x00,0x00,0x00,0xBB};

	TxBuf[3] = First;
	TxBuf[4] = Second;
	TxBuf[5] = Third;


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoZigbee(TxBuf, 8);

}

/**************************************************************************
函数功能：命令-LED标志物显示下面一排数据
入口参数：First Second Third  - 十进制
返回  值：无
**************************************************************************/
void Command_LEDShowDown(uint8_t First, uint8_t Second, uint8_t Third)
{
	uint8_t TxBuf[8]={0x55,0x04,0x02,0x00,0x00,0x00,0x00,0xBB};

	TxBuf[3] = First;
	TxBuf[4] = Second;
	TxBuf[5] = Third;


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoZigbee(TxBuf, 8);

}





/*********************************************智能交通信号灯指令******************************************************/


/**************************************************************************
函数功能：命令-信号灯A进入识别模式
入口参数：无
返回  值：无
**************************************************************************/
void Command_TrafficAInMode(void)
{
	CAN_TxtoZigbee(TrafficA_Open, 8);
}




/**************************************************************************
函数功能：命令-信号灯B进入识别模式
入口参数：无
返回  值：无
**************************************************************************/
void Command_TrafficBInMode(void)
{
	CAN_TxtoZigbee(TrafficB_Open, 8);
}



/**************************************************************************
函数功能：命令-信号灯C进入识别模式
入口参数：无
返回  值：无
**************************************************************************/
void Command_TrafficCInMode(void)
{
	CAN_TxtoZigbee(TrafficC_Open, 8);
}



/**************************************************************************
函数功能：命令-信号灯D进入识别模式
入口参数：无
返回  值：无
**************************************************************************/
void Command_TrafficDInMode(void)
{
	CAN_TxtoZigbee(TrafficD_Open, 8);
}



/**************************************************************************
函数功能：命令-发送给信号灯A识别结果
入口参数：0-red 1-green 2-yellow
返回  值：无
**************************************************************************/
void Command_TrafficASend(void)
{

	switch(AndroidFlag)
	{
	case TrafficRed_Flag:
		CAN_TxtoZigbee(TrafficA_Red, 8);
		break;
	case TrafficGreen_Flag:
		CAN_TxtoZigbee(TrafficA_Green, 8);
		break;
	case TrafficYellow_Flag:
		CAN_TxtoZigbee(TrafficA_Yellow, 8);
		break;
	case TrafficNull:
		break;
	}

}

/**************************************************************************
函数功能：命令-发送给信号灯B识别结果
入口参数：0-red  1-yellow 2-green
返回  值：无
**************************************************************************/
void Command_TrafficBSend(void)
{

	switch(AndroidFlag)
	{
	case TrafficRed_Flag:
		CAN_TxtoZigbee(TrafficB_Red, 8);
		break;
	case TrafficGreen_Flag:
		CAN_TxtoZigbee(TrafficB_Green, 8);
		break;
	case TrafficYellow_Flag:
		CAN_TxtoZigbee(TrafficB_Yellow, 8);
		break;
	case TrafficNull:
		break;
	}

}


/**************************************************************************
函数功能：命令-发送给信号灯C识别结果
入口参数：0-red 1-green 2-yellow
返回  值：无
**************************************************************************/
void Command_TrafficCSend(void)
{
	switch(AndroidFlag)
	{
	case TrafficRed_Flag:
		CAN_TxtoZigbee(TrafficC_Red, 8);
		break;
	case TrafficGreen_Flag:
		CAN_TxtoZigbee(TrafficC_Green, 8);
		break;
	case TrafficYellow_Flag:
		CAN_TxtoZigbee(TrafficC_Yellow, 8);
		break;
	case TrafficNull:
		break;
	}

}


/**************************************************************************
函数功能：命令-发送给信号灯D识别结果
入口参数：0-red 1-green 2-yellow
返回  值：无
**************************************************************************/
void Command_TrafficDSend(void)
{

	switch(AndroidFlag)
	{
	case TrafficRed_Flag:
		CAN_TxtoZigbee(TrafficD_Red, 8);
		break;
	case TrafficGreen_Flag:
		CAN_TxtoZigbee(TrafficD_Green, 8);
		break;
	case TrafficYellow_Flag:
		CAN_TxtoZigbee(TrafficD_Yellow, 8);
		break;
	case TrafficNull:
		break;
	}

}




/*********************************************控制从车指令**************************************************/


/**************************************************************************
函数功能：命令-从车启动
入口参数：无
返回  值：无
**************************************************************************/
void Command_SlaveCarStart(void)
{
	uint8_t TxBuf[8]={0x9f,0x02,0x9f,0x01,0x00,0x00,0x00,0xBB};
	CAN_TxtoZigbee(TxBuf, 8);
}


/**************************************************************************
函数功能：命令-从车发送温度数据
入口参数：无
返回  值：无
**************************************************************************/
void Command_SlaveCarSTep(void)
{
	uint8_t TxBuf[8]={0x9f,0x02,0x9f,0x02,0x00,0x00,0x00,0xBB};

	TxBuf[5] = BusData.temperature;
	CAN_TxtoZigbee(TxBuf, 8);
}


/*********************************************多功能显示**************************************************/



/**************************************************************************
函数功能：命令-多功能显示标志物A 向上翻页
入口参数：无
返回  值：无
**************************************************************************/
void Command_TFTAPageUp(void)
{
	CAN_TxtoZigbee(TFTA_PageUp, 8);
}



/**************************************************************************
函数功能：命令-多功能显示标志物A 向下翻页
入口参数：无
返回  值：无
**************************************************************************/
void Command_TFTAPageDown(void)
{
	CAN_TxtoZigbee(TFTA_PageDown, 8);
}



/**************************************************************************
函数功能：命令-多功能显示标志物B 向上翻页
入口参数：无
返回  值：无
**************************************************************************/
void Command_TFTBPageUp(void)
{
	CAN_TxtoZigbee(TFTB_PageUp, 8);
}



/**************************************************************************
函数功能：命令-多功能显示标志物B 向下翻页
入口参数：无
返回  值：无
**************************************************************************/
void Command_TFTBPageDown(void)
{
	CAN_TxtoZigbee(TFTB_PageDown, 8);
}



/*********************************************LED多功能显示**************************************************/

/**************************************************************************
函数功能：底层-发送指令到安卓终端
入口参数：无
返回  值：无
**************************************************************************/
void Command_SendAndroid(uint8_t First, uint8_t Second)
{
	uint8_t TxBuf[8]={0x55,0x03,0x00,0x00,0x00,0x00,0x00,0xBB};

	TxBuf[2] = First;
	TxBuf[3] = Second;


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoWifi(TxBuf, 8);

}


/**************************************************************************
函数功能：命令-安卓终端 开启交通灯识别
入口参数：无
返回  值：无
**************************************************************************/
void Command_AndroidTraffic(void)
{
	Command_SendAndroid(0x01, 0x01);
}




/*********************************************智能立体车库**************************************************/


/**************************************************************************
函数功能：命令-控制车库A到达指定层数
入口参数：Floor:立体车库层数 1 2 3 4
返回  值：无
**************************************************************************/
void Command_CarPortA(uint8_t Floor)
{
	switch(Floor)
	{
	case 1:
		CAN_TxtoZigbee(GarageA_To1, 8);
		break;
	case 2:
		CAN_TxtoZigbee(GarageA_To2, 8);
		break;

	case 3:
		CAN_TxtoZigbee(GarageA_To3, 8);
		break;

	case 4:
		CAN_TxtoZigbee(GarageA_To4, 8);
		break;
	}
}



/**************************************************************************
函数功能：命令-请求返回车库A当前层数
入口参数：Floor:立体车库层数
返回  值：无
**************************************************************************/
void Command_GetPortAFloor(void)
{
	CAN_TxtoZigbee(GarageA_Get_Floor, 8);
}


/**************************************************************************
函数功能：命令-请求返回车库A前后侧红外状态
入口参数：Floor:立体车库层数
返回  值：无
**************************************************************************/
void Command_GetPortAInfr(void)
{
	CAN_TxtoZigbee(GarageA_Get_Infr, 8);
}



/**************************************************************************
函数功能：命令-控制车库B的层数
入口参数：Floor:立体车库层数 1-4
返回  值：无
**************************************************************************/
void Command_CarPortB(uint8_t Floor)
{
	switch(Floor)
	{
	case 1:
		CAN_TxtoZigbee(GarageB_To1, 8);
		break;
	case 2:
		CAN_TxtoZigbee(GarageB_To2, 8);
		break;

	case 3:
		CAN_TxtoZigbee(GarageB_To3, 8);
		break;

	case 4:
		CAN_TxtoZigbee(GarageB_To4, 8);
		break;
	}
}



/**************************************************************************
函数功能：命令-请求返回车库B当前层数
入口参数：Floor:立体车库层数
返回  值：无
**************************************************************************/
void Command_GetPortBFloor(void)
{
	CAN_TxtoZigbee(GarageB_Get_Floor, 8);
}



/**************************************************************************
函数功能：命令-请求返回车库B前后侧红外状态
入口参数：Floor:立体车库层数
返回  值：无
**************************************************************************/
void Command_GetPortBInfr(void)
{
	CAN_TxtoZigbee(GarageB_Get_Infr, 8);
}




/*********************************************智能公交站**************************************************/



/**************************************************************************
函数功能：命令-公交站台 播报指定信息
入口参数：Number: 1-富强路站 2-民主路站 3-文明路站 4-和谐路站 5-爱国路站 6-敬业路站 7-友善路站
返回  值：无
**************************************************************************/
void Command_BusReportFixed(uint8_t Number)
{

	uint8_t TxBuf[8]={0x55,0x06,0x10,0x00,0x00,0x00,0x00,0xBB};

	switch(Number)
	{
	case 1:
		TxBuf[3] = 0x01;
		break;
	case 2:
		TxBuf[3] = 0x02;
		break;
	case 3:
		TxBuf[3] = 0x03;
		break;
	case 4:
		TxBuf[3] = 0x04;
		break;
	case 5:
		TxBuf[3] = 0x05;
		break;
	case 6:
		TxBuf[3] = 0x06;
		break;
	case 7:
		TxBuf[3] = 0x07;
		break;
	}


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;


	CAN_TxtoZigbee(TxBuf, 8);
}



/**************************************************************************
函数功能：命令-公交站台 播报随机信息(1-7)
入口参数：无
返回  值：无
**************************************************************************/
void Command_BusReportRandom(void)
{
	uint8_t TxBuf[8]={0x55,0x06,0x20,0x01,0x00,0x00,0x00,0xBB};



	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoZigbee(TxBuf, 8);
}




/**************************************************************************
函数功能：命令-公交站台 设置RTC日期
入口参数：年月日
返回  值：无
**************************************************************************/
void Command_BusSetDate(uint8_t Year, uint8_t Month, uint8_t Day)
{
	uint8_t TxBuf[8]={0x55,0x06,0x30,0x00,0x00,0x00,0x00,0xBB};


	TxBuf[3] = Year;
	TxBuf[4] = Month;
	TxBuf[5] = Day;


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoZigbee(TxBuf, 8);
}


/**************************************************************************
函数功能：命令-公交站台 查询RTC日期
入口参数：无
返回  值：无
**************************************************************************/
void Command_BusCheckDate(void)
{
	uint8_t TxBuf[8]={0x55,0x06,0x31,0x01,0x00,0x00,0x00,0xBB};


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoZigbee(TxBuf, 8);
}



/**************************************************************************
函数功能：命令-公交站台 设置RTC时间
入口参数：时分秒
返回  值：无
**************************************************************************/
void Command_BusSetTime(uint8_t Hour, uint8_t Minutes, uint8_t Seconds)
{
	uint8_t TxBuf[8]={0x55,0x06,0x40,0x00,0x00,0x00,0x00,0xBB};

	TxBuf[3] = Hour;
	TxBuf[4] = Minutes;
	TxBuf[5] = Seconds;

	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoZigbee(TxBuf, 8);
}


/**************************************************************************
函数功能：命令-公交站台 查询RTC时间
入口参数：无
返回  值：无
**************************************************************************/
void Command_BusCheakTime(void)
{
	uint8_t TxBuf[8]={0x55,0x06,0x41,0x01,0x00,0x00,0x00,0xBB};



	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoZigbee(TxBuf, 8);
}


/**************************************************************************
函数功能：命令-公交站台 设置天气数据与温度数据
入口参数：Weather:天气	 	  0x00-大风   0x01-多云	 0x02-晴	 0x03-小雪  0x04-小雨 0x05-阴天
	   Temperature：温度    十六进制0x19 = 十进制25°
返回  值：无
**************************************************************************/
void Command_BusSetTem(uint8_t Weather, uint8_t Temperature)
{
	uint8_t TxBuf[8]={0x55,0x06,0x42,0x00,0x00,0x00,0x00,0xBB};


	TxBuf[3] = Weather;
	TxBuf[4] = Temperature;


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoZigbee(TxBuf, 8);
}





/**************************************************************************
函数功能：命令-公交站台 查询天气数据与温度数据
入口参数：无
返回  值：无
**************************************************************************/
void Command_BusCheckTem(void)
{
	uint8_t TxBuf[8]={0x55,0x06,0x43,0x00,0x00,0x00,0x00,0xBB};



	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;

	CAN_TxtoZigbee(TxBuf, 8);
}








/*********************************************智能路灯**************************************************/

/**************************************************************************
函数功能：命令-智能路灯 增加亮度档位
入口参数：Gear:增加亮度档位 1:+1  2:+2  3:+3
返回  值：无
**************************************************************************/
void Command_Light(uint8_t Gear)
{
	switch(Gear)
	{
	case 1:
		Infrared_SendpData(Light_plus1, 4);
		break;

	case 2:
		Infrared_SendpData(Light_plus2, 4);
		break;

	case 3:
		Infrared_SendpData(Light_plus3, 4);
		break;
	}

}

/**************************************************************************
函数功能：命令-智能路灯 调节至指定档位
入口参数：Location:指定档位
返回  值：无
**************************************************************************/
uint8_t Command_LightAuto(uint8_t Loaction)
{
	uint8_t Gear_Init = 0;	// 初始挡位值
	uint16_t LuxBuf[2];		//缓存自学习的光档位数组
//	char TestData[30];

	for(uint8_t i=1;i<5;i++)/*1-4*/
	{
		LuxBuf[0] = BH1750_GetLux	();	/*原本光照值*/

//		sprintf(TestData,"Lux%d:%d\r\n",i,LuxBuf[0]);
//		CAN_TxtoDisplay(TestData, strlen(TestData));

		Command_Light(1); /*加一档*/

		My_Delayms(800);

		LuxBuf[1] = BH1750_GetLux();	/*原本光照值*/
//		sprintf(TestData,"Lux%d:%d\r\n",i,LuxBuf[1]);
//		CAN_TxtoDisplay(TestData, strlen(TestData));

		if(LuxBuf[0] > LuxBuf[1]) /*如果上一档的光照值更亮*/
		{
			Gear_Init = 5 - (i-1);
			My_Delayms(700);
			break;
		}

	}

	Command_Light(Loaction-1);  /*从第一档加到指定档位*/


	return Gear_Init;
}



/*********************************************智能报警台**************************************************/

/**************************************************************************
函数功能：命令-报警台 使用红外通信开启
入口参数：TxData-6字节开启码
返回  值：无
**************************************************************************/
void Command_AlarmStart(void)
{
	Infrared_SendpData(Alarm_Open, 6);
}


/**************************************************************************
函数功能：命令-报警台 使用红外通信关闭
入口参数：TxData-6字节开启码
返回  值：无
**************************************************************************/
void Command_AlarmEnd(void)
{
	Infrared_SendpData(Alarm_Close, 6);
}




/**************************************************************************
函数功能：命令-报警台 请求回传救援坐标
入口参数：无
返回  值：无
**************************************************************************/
void Command_AlarmReq(void)
{
	uint8_t TxBuf[8]={0x55,0x07,0x09,0x00,0x00,0x00,0x00,0xBB};


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;


	Infrared_SendpData(TxBuf, 8);
}



/*********************************************自动评分系统**************************************************/



/**************************************************************************
函数功能：命令-自动评分系统
入口参数：无
返回  值：无
**************************************************************************/
void Command_Autosystem(uint8_t Number)
{
	uint8_t TxBuf[8]={0xAF,0x06,0x00,0x02,0x00,0x00,0x01,0xBB};


	TxBuf[2] = Number;


	CAN_TxtoZigbee(TxBuf, 8);
}






/*********************************************智能无线充电**************************************************/



/**************************************************************************
函数功能：命令-无线充电站开启
入口参数：无
返回  值：无
**************************************************************************/
void Command_WireCharStart(void)
{
	uint8_t TxBuf[8]={0x55,0x0A,0x01,0x01,0x00,0x00,0x00,0xBB};


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;


	CAN_TxtoZigbee(TxBuf, 8);
}


/**************************************************************************
函数功能：命令-无线充电站关闭
入口参数：无
返回  值：无
**************************************************************************/
void Command_WireCharEnd(void)
{
	uint8_t TxBuf[8]={0x55,0x0A,0x01,0x02,0x00,0x00,0x00,0xBB};


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;


	CAN_TxtoZigbee(TxBuf, 8);
}



/*********************************************ETC闸门**************************************************/


/**************************************************************************
函数功能：命令-ETC闸门上调初始角度
入口参数：无
返回  值：无
**************************************************************************/
void Command_ETCUp(void)
{
	uint8_t TxBuf[8]={0x55,0x0C,0x08,0x01,0x01,0x00,0x00,0xBB};


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;


	CAN_TxtoZigbee(TxBuf, 8);
}


/**************************************************************************
函数功能：命令-ETC闸门下调初始角度
入口参数：无
返回  值：无
**************************************************************************/
void Command_ETCDown(void)
{
	uint8_t TxBuf[8]={0x55,0x0C,0x08,0x02,0x02,0x00,0x00,0xBB};


	TxBuf[6] = (TxBuf[2] + TxBuf[3] + TxBuf[4] + TxBuf[5])%256;


	CAN_TxtoZigbee(TxBuf, 8);
}













