#include "Time_Interrupt.h"


/**********************************************************
 *
 * 介于hal的中断回调机制,将回调函数放在一个文件处理
 *
 **********************************************************/



/**************************************************************************
 HAL中断回调函数
**************************************************************************/
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
	if(htim == &htim9)	/*Motor-TIM9中断 psc:168-1 arr:=1000-1 中断时间:1ms*/
	{
		TurnAngle_Check();
		Go_and_Back_Check();

	}


}


























